app/controllers/funding_pages_controller.rb

SELECT "funding_pages".* FROM "funding_pages"
---
  def index
    @funding_pages = FundingPage.all

SELECT "funding_pages".* FROM "funding_pages" WHERE "funding_pages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @funding_page = FundingPage.find(params[:id])

INSERT INTO "funding_pages" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 25 Oct 2012 03:02:25 UTC +00:00], ["description", "Helloo"], ["title", "Ugly"], ["updated_at", Thu, 25 Oct 2012 03:02:25 UTC +00:00], ["user_id", 1]]
---
  def create
    @funding_page = current_user.funding_pages.build(params[:funding_page])

    respond_to do |format|
      if @funding_page.save